# Import Libraries

In [1]:
# Import libraries
import pandas as pd
import numpy as np
import os

# Import dataset

In [2]:
# Create path variable
path = r'C:\Users\babum\Desktop\CF_Data Analytics\Data Immersion\Achievement 4\02-2023 Instacart Basket Analysis'

In [3]:
#Import products dataset from original data
df_prods = pd.read_csv(os.path.join(path,'02 Data','Original Data','products.csv'), index_col = False)

# Mixed-Type data

In [4]:
# Create dataframe
df_test = pd.DataFrame()

In [5]:
#Create a mixed type column
df_test['mix'] = ['a','b',1,True]

In [6]:
df_test.head()

    mix
0     a
1     b
2     1
3  True

In [7]:
# Check for mixed type data
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

mix

In [8]:
# Changing the mixed type data to str
df_test['mix'] = df_test['mix'].astype('str')

In [9]:
# Check for mixed type data
for col in df_test.columns.tolist():
  weird = (df_test[[col]].applymap(type) != df_test[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_test[weird]) > 0:
    print (col)

# Missing values

In [10]:
# Finding missing values
df_prods.isnull().sum()

product_id        0
product_name     16
aisle_id          0
department_id     0
prices            0
dtype: int64

In [11]:
# Create new dataframe
df_nan = df_prods[df_prods['product_name'].isnull() == True]

In [12]:
df_nan

       product_id product_name  aisle_id  department_id  prices
33             34          NaN       121             14    12.2
68             69          NaN        26              7    11.8
115           116          NaN        93              3    10.8
261           262          NaN       110             13    12.1
525           525          NaN       109             11     1.2
1511         1511          NaN        84             16    14.3
1780         1780          NaN       126             11    12.3
2240         2240          NaN        52              1    14.2
2586         2586          NaN       104             13    12.4
3159         3159          NaN       126             11    13.1
3230         3230          NaN       120             16    14.4
3736         3736          NaN        41              8    14.8
4283         4283          NaN        77              7    14.4
4790         4790          NaN        91             16    14.5
38187       38183          NaN        39             12    20.9
40444       40440          NaN       120             16    14.8

In [13]:
df_prods.shape

(49693, 5)

In [14]:
df_nan.shape

(16, 5)

In [15]:
# Creating clean dataframe
df_prods_clean = df_prods[df_prods['product_name'].isnull() == False]

In [16]:
df_prods_clean.shape

(49677, 5)

# Duplicates

In [17]:
# Creating new dataframe for duplicated values
df_dups = df_prods_clean[df_prods_clean.duplicated()]

In [18]:
df_dups

,product_id,product_name,aisle_id,department_id,prices
462,462,Fiber 4g Gummy Dietary Supplement,70,11,4.8
18459,18458,Ranger IPA,27,5,9.2
26810,26808,Black House Coffee Roasty Stout Beer,27,5,13.4
35309,35306,Gluten Free Organic Peanut Butter & Chocolate ...,121,14,6.8
35495,35491,Adore Forever Body Wash,127,11,9.9

In [19]:
df_prods_clean.shape

(49677, 5)

In [20]:
# Creating new clean dataframe without duplicate values
df_prods_clean_no_dups = df_prods_clean.drop_duplicates()

In [21]:
df_prods_clean_no_dups.shape

(49672, 5)

# Task 4.5

In [22]:
#Import orders dataframe from prepared data
df_ords = pd.read_csv(os.path.join(path,'02 Data','Prepared Data', 'orders_wrangled.csv'), index_col = 0)

In [23]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
1,2398795,1,2,3,7,15.0
2,473747,1,3,3,12,21.0
3,2254736,1,4,4,7,29.0
4,431534,1,5,4,15,28.0

In [24]:
# Changing datatype of order_id and user_id
df_ords['order_id'] = df_ords['order_id'].astype('str')
df_ords['user_id'] = df_ords['user_id'].astype('str')

In [25]:
df_ords.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 3421083 entries, 0 to 3421082
Data columns (total 6 columns):
 #   Column                  Dtype
---  ------                  -----
 0   order_id                object
 1   user_id                 object
 2   order_number            int64
 3   orders_day_of_week      int64
 4   order_hour_of_day       int64
 5   days_since_prior_order  float64
dtypes: float64(1), int64(3), object(2)
memory usage: 182.7+ MB

In [26]:
# 2.Describe function on df_ords
df_ords.describe()

,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
count,3.421083e+06,3.421083e+06,3.421083e+06,3.214874e+06
mean,1.715486e+01,2.776219e+00,1.345202e+01,1.111484e+01
std,1.773316e+01,2.046829e+00,4.226088e+00,9.206737e+00
min,1.000000e+00,0.000000e+00,0.000000e+00,0.000000e+00
25%,5.000000e+00,1.000000e+00,1.000000e+01,4.000000e+00
50%,1.100000e+01,3.000000e+00,1.300000e+01,7.000000e+00
75%,2.300000e+01,5.000000e+00,1.600000e+01,1.500000e+01
max,1.000000e+02,6.000000e+00,2.300000e+01,3.000000e+01

In [27]:
# Changing datatype in df_prods
df_prods['product_id'] = df_prods['product_id'].astype('str')
df_prods['aisle_id'] = df_prods['aisle_id'].astype('str')
df_prods['department_id'] = df_prods['department_id'].astype('str')

In [28]:
df_prods.describe()

             prices
count  49693.000000
mean       9.994136
std      453.519686
min        1.000000
25%        4.100000
50%        7.100000
75%       11.200000
max    99999.000000

In [29]:
df_prods['prices'].value_counts()

2.5        470
5.3        458
6.2        451
2.6        447
5.4        444
          ...
21.0         1
99999.0      1
21.4         1
15.6         1
18.3         1
Name: prices, Length: 242, dtype: int64

In [30]:
df_prods[df_prods.prices == 99999]

      product_id           product_name aisle_id department_id   prices
33666      33664  2 % Reduced Fat  Milk       84            16  99999.0

# According to the describe function df_ords values doesnot have any mismatch. The price value in df_prods has a max of 99999, this data needs to be investigated further.

In [31]:
# 3.Mixed datatype in df_ords
for col in df_ords.columns.tolist():
  weird = (df_ords[[col]].applymap(type) != df_ords[[col]].iloc[0].apply(type)).any(axis = 1)
  if len (df_ords[weird]) > 0:
    print (col)

# Orders dataframe has no mixed datatype

In [32]:
# 4. Checking the datatype
df_ords.dtypes

order_id                   object
user_id                    object
order_number                int64
orders_day_of_week          int64
order_hour_of_day           int64
days_since_prior_order    float64
dtype: object

In [33]:
# 5.Missing values in df_ords
df_ords.isnull().sum()

order_id                       0
user_id                        0
order_number                   0
orders_day_of_week             0
order_hour_of_day              0
days_since_prior_order    206209
dtype: int64

In [34]:
df_ords_nan = df_ords[df_ords['days_since_prior_order'].isnull()==True]

In [35]:
df_ords_nan

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order
0,2539329,1,1,2,8,NaN
11,2168274,2,1,2,11,NaN
26,1374495,3,1,1,14,NaN
39,3343014,4,1,6,11,NaN
45,2717275,5,1,3,12,NaN
...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN
3420934,3189322,206206,1,3,18,NaN
3421002,2166133,206207,1,6,19,NaN
3421019,2227043,206208,1,1,15,NaN
3421069,3154581,206209,1,3,11,NaN

In [36]:
df_ords.shape

(3421083, 6)

In [37]:
df_ords_nan['order_number'].value_counts()

1    206209
Name: order_number, dtype: int64

# 5. 6% of the data in days_since_prior_order are missing. All these missing data is for order_number 1. This might be because these order_number 1 must be their first order in the store as they might be the new customers to the store. Hence they do not have any prior order data.

In [38]:
df_ords['customer_status'] = np.where(df_ords['order_number'] == 1, 'new','existing')

In [39]:
df_ords.head()

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status
0,2539329,1,1,2,8,NaN,new
1,2398795,1,2,3,7,15.0,existing
2,473747,1,3,3,12,21.0,existing
3,2254736,1,4,4,7,29.0,existing
4,431534,1,5,4,15,28.0,existing

In [40]:
df_ords_nan_check = df_ords[df_ords['days_since_prior_order'].isnull()==True]

In [41]:
df_ords_nan_check

,order_id,user_id,order_number,orders_day_of_week,order_hour_of_day,days_since_prior_order,customer_status
0,2539329,1,1,2,8,NaN,new
11,2168274,2,1,2,11,NaN,new
26,1374495,3,1,1,14,NaN,new
39,3343014,4,1,6,11,NaN,new
45,2717275,5,1,3,12,NaN,new
...,...,...,...,...,...,...,...
3420930,969311,206205,1,4,12,NaN,new
3420934,3189322,206206,1,3,18,NaN,new
3421002,2166133,206207,1,6,19,NaN,new
3421019,2227043,206208,1,1,15,NaN,new
3421069,3154581,206209,1,3,11,NaN,new

# 6. These missing values are for the order_number 1 where these are considered the new customers who doesnot have prior order details. This might be important as these are the new customers to the store hence the missing data is not deleted but a new column was created mentioning these data as new and others as existing.

In [42]:
# Finding Duplicates
df_ords_dups = df_ords[df_ords.duplicated()]

In [43]:
df_ords_dups

Empty DataFrame
Columns: [order_id, user_id, order_number, orders_day_of_week, order_hour_of_day, days_since_prior_order, customer_status]
Index: []

# There are no duplicates found in the orders dataframe. There are no multiple rows that have the exact same values in every column

In [44]:
# 9.Exporting products and orders dataframe after consistency check
df_ords.to_csv(os.path.join(path, '02 Data','Prepared Data', 'orders_checked.csv'))
df_prods_clean_no_dups.to_csv(os.path.join(path, '02 Data','Prepared Data', 'products_checked.csv'))